In [45]:
import pandas as pd
import numpy as np

# DataFrame 생성하기 - 딕셔너리로 생성
data = {
    '이름': ['김철수', '이영희', '박민수', '정수진', '최동욱'],
    '나이': [25, 30, 35, 28, 32],
    '도시': ['서울', '부산', '서울', '대구', '부산'],
    '점수': [85, 92, 78, 95, 88]
}
df = pd.DataFrame(data)
print(df)

    이름  나이  도시  점수
0  김철수  25  서울  85
1  이영희  30  부산  92
2  박민수  35  서울  78
3  정수진  28  대구  95
4  최동욱  32  부산  88

In [3]:
print(df)

    이름  나이  도시  점수
0  김철수  25  서울  85
1  이영희  30  부산  92
2  박민수  35  서울  78
3  정수진  28  대구  95
4  최동욱  32  부산  88

In [4]:
df

    이름  나이  도시  점수
0  김철수  25  서울  85
1  이영희  30  부산  92
2  박민수  35  서울  78
3  정수진  28  대구  95
4  최동욱  32  부산  88

In [5]:
df.iloc[0]

이름    김철수
나이     25
도시     서울
점수     85
Name: 0, dtype: object

In [9]:
df.iloc[0, 3]

np.int64(85)

In [10]:
df.loc[0, '점수']

np.int64(85)

In [11]:
df.loc[0, '점수'] = 90

In [12]:
df.iloc[0, 3]

np.int64(90)

In [13]:
df['나이'] >= 30

0    False
1     True
2     True
3    False
4     True
Name: 나이, dtype: bool

In [15]:
mask = df['나이'] >= 30

In [16]:
df[mask]

    이름  나이  도시  점수
1  이영희  30  부산  92
2  박민수  35  서울  78
4  최동욱  32  부산  88

In [17]:
df.loc[df['나이'] >= 30, '점수']

1    92
2    78
4    88
Name: 점수, dtype: int64

In [19]:
# 조건부 변경
df.loc[df['나이'] >= 30, '점수'] = 0

In [22]:
df

    이름  나이  도시  점수
0  김철수  25  서울  90
1  이영희  30  부산   0
2  박민수  35  서울   0
3  정수진  28  대구  95
4  최동욱  32  부산   0

In [46]:
# 조건부 변경
df.loc[df['나이'] >= 30, '등급'] = 'A+'  # 나이 30 이상인 사람 등급을 A+로 변경

In [47]:
df

    이름  나이  도시  점수   등급
0  김철수  25  서울  85  NaN
1  이영희  30  부산  92   A+
2  박민수  35  서울  78   A+
3  정수진  28  대구  95  NaN
4  최동욱  32  부산  88   A+

In [ ]:
df['도시'].replace('서울', '수도권')

0    수도권
1     부산
2    수도권
3     대구
4     부산
Name: 도시, dtype: object

In [48]:
df['도시'] = df['도시'].replace('서울', '수도권')

In [49]:
df

    이름  나이   도시  점수   등급
0  김철수  25  수도권  85  NaN
1  이영희  30   부산  92   A+
2  박민수  35  수도권  78   A+
3  정수진  28   대구  95  NaN
4  최동욱  32   부산  88   A+

In [32]:
pd.DataFrame.replace?

Signature:
pd.DataFrame.replace(
    self,
    to_replace=None,
    value=<no_default>,
    *,
    inplace: 'bool_t' = False,
    limit: 'int | None' = None,
    regex: 'bool_t' = False,
    method: "Literal['pad', 'ffill', 'bfill'] | lib.NoDefault" = <no_default>,
) -> 'Self | None'
Docstring:
Replace values given in `to_replace` with `value`.

Values of the Series/DataFrame are replaced with other values dynamically.
This differs from updating with ``.loc`` or ``.iloc``, which require
you to specify a location to update with some value.

Parameters
----------
to_replace : str, regex, list, dict, Series, int, float, or None
    How to find the values that will be replaced.

    * numeric, str or regex:

        - numeric: numeric values equal to `to_replace` will be
          replaced with `value`
        - str: string exactly matching `to_replace` will be replaced
          with `value`
        - regex: regexs matching `to_replace` will be replaced with
          `value`

    * list of str, regex, or numeric:

        - First, if `to_replace` and `value` are both lists, they
          **must** be the same length.
        - Second, if ``regex=True`` then all of the strings in **both**
          lists will be interpreted as regexs otherwise they will match
          directly. This doesn't matter much for `value` since there
          are only a few possible substitution regexes you can use.
        - str, regex and numeric rules apply as above.

    * dict:

        - Dicts can be used to specify different replacement values
          for different existing values. For example,
          ``{'a': 'b', 'y': 'z'}`` replaces the value 'a' with 'b' and
          'y' with 'z'. To use a dict in this way, the optional `value`
          parameter should not be given.
        - For a DataFrame a dict can specify that different values
          should be replaced in different columns. For example,
          ``{'a': 1, 'b': 'z'}`` looks for the value 1 in column 'a'
          and the value 'z' in column 'b' and replaces these values
          with whatever is specified in `value`. The `value` parameter
          should not be ``None`` in this case. You can treat this as a
          special case of passing two lists except that you are
          specifying the column to search in.
        - For a DataFrame nested dictionaries, e.g.,
          ``{'a': {'b': np.nan}}``, are read as follows: look in column
          'a' for the value 'b' and replace it with NaN. The optional `value`
          parameter should not be specified to use a nested dict in this
          way. You can nest regular expressions as well. Note that
          column names (the top-level dictionary keys in a nested
          dictionary) **cannot** be regular expressions.

    * None:

        - This means that the `regex` argument must be a string,
          compiled regular expression, or list, dict, ndarray or
          Series of such elements. If `value` is also ``None`` then
          this **must** be a nested dictionary or Series.

    See the examples section for examples of each of these.
value : scalar, dict, list, str, regex, default None
    Value to replace any values matching `to_replace` with.
    For a DataFrame a dict of values can be used to specify which
    value to use for each column (columns not in the dict will not be
    filled). Regular expressions, strings and lists or dicts of such
    objects are also allowed.

inplace : bool, default False
    If True, performs operation inplace and returns None.
limit : int, default None
    Maximum size gap to forward or backward fill.

    .. deprecated:: 2.1.0
regex : bool or same types as `to_replace`, default False
    Whether to interpret `to_replace` and/or `value` as regular
    expressions. Alternatively, this could be a regular expression or a
    list, dict, or array of regular expressions in which case
    `to_replace` must be ``None``.
method : {'pad', 'ffill', 'bfill'}
    The method to use when for replacement, when `to_replace` is a
    scalar, list or tuple and `value` is ``None``.

    .. deprecated:: 2.1.0

Returns
-------
Series/DataFrame
    Object after replacement.

Raises
------
AssertionError
    * If `regex` is not a ``bool`` and `to_replace` is not
      ``None``.

TypeError
    * If `to_replace` is not a scalar, array-like, ``dict``, or ``None``
    * If `to_replace` is a ``dict`` and `value` is not a ``list``,
      ``dict``, ``ndarray``, or ``Series``
    * If `to_replace` is ``None`` and `regex` is not compilable
      into a regular expression or is a list, dict, ndarray, or
      Series.
    * When replacing multiple ``bool`` or ``datetime64`` objects and
      the arguments to `to_replace` does not match the type of the
      value being replaced

ValueError
    * If a ``list`` or an ``ndarray`` is passed to `to_replace` and
      `value` but they are not the same length.

See Also
--------
Series.fillna : Fill NA values.
DataFrame.fillna : Fill NA values.
Series.where : Replace values based on boolean condition.
DataFrame.where : Replace values based on boolean condition.
DataFrame.map: Apply a function to a Dataframe elementwise.
Series.map: Map values of Series according to an input mapping or function.
Series.str.replace : Simple string replacement.

Notes
-----
* Regex substitution is performed under the hood with ``re.sub``. The
  rules for substitution for ``re.sub`` are the same.
* Regular expressions will only substitute on strings, meaning you
  cannot provide, for example, a regular expression matching floating
  point numbers and expect the columns in your frame that have a
  numeric dtype to be matched. However, if those floating point
  numbers *are* strings, then you can do this.
* This method has *a lot* of options. You are encouraged to experiment
  and play with this method to gain intuition about how it works.
* When dict is used as the `to_replace` value, it is like
  key(s) in the dict are the to_replace part and
  value(s) in the dict are the value parameter.

Examples
--------

**Scalar `to_replace` and `value`**

>>> s = pd.Series([1, 2, 3, 4, 5])
>>> s.replace(1, 5)
0    5
1    2
2    3
3    4
4    5
dtype: int64

>>> df = pd.DataFrame({'A': [0, 1, 2, 3, 4],
...                    'B': [5, 6, 7, 8, 9],
...                    'C': ['a', 'b', 'c', 'd', 'e']})
>>> df.replace(0, 5)
    A  B  C
0  5  5  a
1  1  6  b
2  2  7  c
3  3  8  d
4  4  9  e

**List-like `to_replace`**

>>> df.replace([0, 1, 2, 3], 4)
    A  B  C
0  4  5  a
1  4  6  b
2  4  7  c
3  4  8  d
4  4  9  e

>>> df.replace([0, 1, 2, 3], [4, 3, 2, 1])
    A  B  C
0  4  5  a
1  3  6  b
2  2  7  c
3  1  8  d
4  4  9  e

>>> s.replace([1, 2], method='bfill')
0    3
1    3
2    3
3    4
4    5
dtype: int64

**dict-like `to_replace`**

>>> df.replace({0: 10, 1: 100})
        A  B  C
0   10  5  a
1  100  6  b
2    2  7  c
3    3  8  d
4    4  9  e

>>> df.replace({'A': 0, 'B': 5}, 100)
        A    B  C
0  100  100  a
1    1    6  b
2    2    7  c
3    3    8  d
4    4    9  e

>>> df.replace({'A': {0: 100, 4: 400}})
        A  B  C
0  100  5  a
1    1  6  b
2    2  7  c
3    3  8  d
4  400  9  e

**Regular expression `to_replace`**

>>> df = pd.DataFrame({'A': ['bat', 'foo', 'bait'],
...                    'B': ['abc', 'bar', 'xyz']})
>>> df.replace(to_replace=r'^ba.$', value='new', regex=True)
        A    B
0   new  abc
1   foo  new
2  bait  xyz

>>> df.replace({'A': r'^ba.$'}, {'A': 'new'}, regex=True)
        A    B
0   new  abc
1   foo  bar
2  bait  xyz

>>> df.replace(regex=r'^ba.$', value='new')
        A    B
0   new  abc
1   foo  new
2  bait  xyz

>>> df.replace(regex={r'^ba.$': 'new', 'foo': 'xyz'})
        A    B
0   new  abc
1   xyz  new
2  bait  xyz

>>> df.replace(regex=[r'^ba.$', 'foo'], value='new')
        A    B
0   new  abc
1   new  new
2  bait  xyz

Compare the behavior of ``s.replace({'a': None})`` and
``s.replace('a', None)`` to understand the peculiarities
of the `to_replace` parameter:

>>> s = pd.Series([10, 'a', 'a', 'b', 'a'])

When one uses a dict as the `to_replace` value, it is like the
value(s) in the dict are equal to the `value` parameter.
``s.replace({'a': None})`` is equivalent to
``s.replace(to_replace={'a': None}, value=None, method=None)``:

>>> s.replace({'a': None})
0      10
1    None
2    None
3       b
4    None
dtype: object

When ``value`` is not explicitly passed and `to_replace` is a scalar, list
or tuple, `replace` uses the method parameter (default 'pad') to do the
replacement. So this is why the 'a' values are being replaced by 10
in rows 1 and 2 and 'b' in row 4 in this case.

>>> s.replace('a')
0    10
1    10
2    10
3     b
4     b
dtype: object

    .. deprecated:: 2.1.0
        The 'method' parameter and padding behavior are deprecated.

On the other hand, if ``None`` is explicitly passed for ``value``, it will
be respected:

>>> s.replace('a', None)
0      10
1    None
2    None
3       b
4    None
dtype: object

    .. versionchanged:: 1.4.0
        Previously the explicit ``None`` was silently ignored.

When ``regex=True``, ``value`` is not ``None`` and `to_replace` is a string,
the replacement will be applied in all columns of the DataFrame.

>>> df = pd.DataFrame({'A': [0, 1, 2, 3, 4],
...                    'B': ['a', 'b', 'c', 'd', 'e'],
...                    'C': ['f', 'g', 'h', 'i', 'j']})

>>> df.replace(to_replace='^[a-g]', value='e', regex=True)
    A  B  C
0  0  e  e
1  1  e  e
2  2  e  h
3  3  e  i
4  4  e  j

If ``value`` is not ``None`` and `to_replace` is a dictionary, the dictionary
keys will be the DataFrame columns that the replacement will be applied.

>>> df.replace(to_replace={'B': '^[a-c]', 'C': '^[h-j]'}, value='e', regex=True)
    A  B  C
0  0  e  f
1  1  e  g
2  2  e  e
3  3  d  e
4  4  e  e
File:      ~/miniconda3/envs/univ_pratice_programming/lib/python3.13/site-packages/pandas/core/generic.py
Type:      function

In [36]:
df['도시'].replace('서울', '수도권', inplace=True)

/var/folders/yy/g6_xynnj5519gch2vc0vscw00000gn/T/ipykernel_14915/2707984102.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['도시'].replace('서울', '수도권', inplace=True)

In [37]:
df

    이름  나이   도시  점수   등급
0  김철수  25  수도권  85  NaN
1  이영희  30   부산  92   A+
2  박민수  35  수도권  78   A+
3  정수진  28   대구  95  NaN
4  최동욱  32   부산  88   A+

deprecated : 조사

regex : regular expressiona

data filtering

isin()

where(), mask()

In [ ]:
# 여러 값을 하나의 값으로 변경 (리스트 사용)
df['도시'] = df['도시'].replace(['부산', '대구'], '지방')
print(df[['이름', '도시']])
print()

In [ ]:
# DataFrame 전체에 적용
df_copy = df.copy()
df_copy = df_copy.replace({'수도권': '서울', '지방': '기타'})
print(df_copy[['이름', '도시']])
print()

In [38]:
df

    이름  나이   도시  점수   등급
0  김철수  25  수도권  85  NaN
1  이영희  30   부산  92   A+
2  박민수  35  수도권  78   A+
3  정수진  28   대구  95  NaN
4  최동욱  32   부산  88   A+

In [50]:
df.loc[5] = ['이제석', 20, '수도권', 100, 'A+']

In [51]:
df

    이름  나이   도시   점수   등급
0  김철수  25  수도권   85  NaN
1  이영희  30   부산   92   A+
2  박민수  35  수도권   78   A+
3  정수진  28   대구   95  NaN
4  최동욱  32   부산   88   A+
5  이제석  20  수도권  100   A+

In [ ]:
new_rows = pd.DataFrame({
    '이름': ['강동원', '송혜교'],
    '나이': [33, 29],
    '도시': ['수도권', '대구'],
    '점수': [91, 87],
    '등급': ['A', 'B'],
})
df = pd.concat([df, new_rows], ignore_index=True)

In [54]:
df

    이름  나이   도시   점수   등급
0  김철수  25  수도권   85  NaN
1  이영희  30   부산   92   A+
2  박민수  35  수도권   78   A+
3  정수진  28   대구   95  NaN
4  최동욱  32   부산   88   A+
5  이제석  20  수도권  100   A+
6  강동원  33  수도권   91    A
7  송혜교  29   대구   87    B

In [56]:
df['이름'].count()

np.int64(8)

In [58]:
len(df)

8

In [ ]:
df.iloc[3, 0]

TypeError: count expected at least 1 argument, got 0

In [70]:
a = df['점수'].agg(['mean', 'median', 'std', 'min', 'max'])

In [71]:
type(a)

pandas.core.series.Series

In [72]:
a.index

Index(['mean', 'median', 'std', 'min', 'max'], dtype='object')

In [73]:
a.name

'점수'

In [74]:
a.loc['mean']

np.float64(89.5)

In [78]:
b = df[['나이', '점수']].agg(['mean', 'min', 'max'])

In [79]:
type(b)

pandas.core.frame.DataFrame

In [4]:
'''
along axis : 그 축을 따라 사라짐
deprecated
'''

'\nalong axis : 그 축을 따라 사라짐\ndeprecated\n'

In [ ]:
import pandas as pd

# 1) 기본 예제 데이터
df = pd.DataFrame({
    "class": ["A", "A", "A", "B", "B", "C", "C", "C", "C"],
    "sex":   ["F", "M", "F", "M", "F", "M", "F", "F", "M"],
    "score": [80, 70, 90, 60, 75, 88, 92, 85, 73],
    "age":   [20, 22, 21, 24, 23, 26, 22, 21, 27],
})

df

  class sex  score  age
0     A   F     80   20
1     A   M     70   22
2     A   F     90   21
3     B   M     60   24
4     B   F     75   23
5     C   M     88   26
6     C   F     92   22
7     C   F     85   21
8     C   M     73   27

In [ ]:
temp = df.groupby("class")

print(type(temp))
print(temp)

# temp.shape # DataFrameGroupBy

# AttributeError: 'DataFrameGroupBy' object has no attribute 'shape'

temp.mean(numeric_only=True)

# temp.mean()
# TypeError: agg function failed [how->mean,dtype->object]

<class 'pandas.core.groupby.generic.DataFrameGroupBy'>
<pandas.core.groupby.generic.DataFrameGroupBy object at 0x149b90380>

TypeError: agg function failed [how->mean,dtype->object]

In [11]:
temp = df.groupby("class").mean(numeric_only=True)

print(type(temp))
print(temp)

<class 'pandas.core.frame.DataFrame'>
       score   age
class
A       80.0  21.0
B       67.5  23.5
C       84.5  24.0

In [18]:
val = df.groupby("class").mean(numeric_only=True)

print(val.__repr__)

<bound method DataFrame.__repr__ of        score   age
class
A       80.0  21.0
B       67.5  23.5
C       84.5  24.0>

In [ ]:
temp = df.groupby("class")["score"].mean()

print(type(temp))
print(temp)

In [19]:
temp = df.groupby("class")[["score"]].mean()

print(type(temp))
print(temp)

<class 'pandas.core.frame.DataFrame'>
       score
class
A       80.0
B       67.5
C       84.5

In [24]:
# 다중 컬럼명
temp = df.groupby(["class","sex"])["score"].mean()

print(type(temp))
print(temp)

temp.loc["A"]

<class 'pandas.core.series.Series'>
class  sex
A      F      85.0
       M      70.0
B      F      75.0
       M      60.0
C      F      88.5
       M      80.5
Name: score, dtype: float64

sex
F    85.0
M    70.0
Name: score, dtype: float64

In [20]:
row_groups = [i % 2 for i in range(len(df))]
print(df.groupby(row_groups)["score"].mean())

0    82.00
1    75.75
Name: score, dtype: float64